{
  "backend/main.mo": "Motoko actor implementing a booking management system with CRUD operations for service bookings, including status toggling between pending and completed states.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features related to admin dashboard routing, booking display, status toggling, and error handling with high confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend component files describing their functionality, including routing, UI components, hooks, and styling configurations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for colors, borders, and spacing.",
  "frontend/index.html": "HTML entry point for the Servexa Pvt Ltd website with basic meta tags and a root div for React mounting.",
  "frontend/src/App.tsx": "Main React application using TanStack Router to configure routes for the home page and admin dashboard, both wrapped in a shared layout with header and navy gradient background.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component displaying booking requests in a table with status badges, dropdown menus for status updates, error handling, loading states, and refresh functionality.",
  "frontend/src/components/BeforeAfterGallery.tsx": "Gallery component showcasing before/after images of completed service work in a responsive grid with glassmorphism styling and hover effects.",
  "frontend/src/components/BookingForm.tsx": "A form component for booking home services that collects customer name, phone, service category, and address, with success state handling and submission via useSubmitBooking hook.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information including three phone numbers, WhatsApp link, physical address in Kolkata, and Instagram social media link in a two-column grid layout.",
  "frontend/src/components/FAQSection.tsx": "An accordion-based FAQ section displaying six common questions and answers about service areas, pricing, warranties, and technician certifications.",
  "frontend/src/components/FloatingWhatsApp.tsx": "A fixed floating button in the bottom-right corner that opens WhatsApp chat with a pre-filled message when clicked.",
  "frontend/src/components/Footer.tsx": "A simple footer displaying copyright information for Servexa Pvt Ltd and a credit link to caffeine.ai with dynamic year and hostname.",
  "frontend/src/components/Header.tsx": "A fixed header with Servexa logo, company name, and a call-now button that initiates a phone call to the business number.",
  "frontend/src/components/HeroSection.tsx": "The main hero section with background image, headline about home services, CTA buttons for calling and WhatsApp, and trust badges showcasing verified technicians and service guarantees.",
  "frontend/src/components/ServiceAreas.tsx": "A simple section displaying the two service areas (Kolkata and Howrah) in a two-column grid with map pin icons.",
  "frontend/src/components/ServicesSection.tsx": "Displays three service categories (Home Appliance Repair, Plumbing, Electrical) in cards with icons and bulleted lists of specific services offered.",
  "frontend/src/components/StickyCallBar.tsx": "A mobile-only sticky bottom bar with a prominent call button displaying the phone number, visible only on small screens.",
  "frontend/src/components/TestimonialSlider.tsx": "React component that displays customer testimonials in an auto-rotating slider with manual navigation controls, showing ratings, quotes, names, and service types.",
  "frontend/src/components/WhyChooseUs.tsx": "React component that renders a grid of five benefit cards highlighting Servexa's key value propositions including verified technicians, fast service, affordable pricing, brand coverage, and same-day availability.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login state, identity persistence, and providing authentication context throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Custom React hooks for backend data operations including submitting bookings, fetching all bookings, and updating booking status using React Query mutations and queries.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration, custom CSS variables for navy-gold color scheme, glass-morphism effects, and typography using Poppins font family.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palette (navy-primary, gold-accent), extended theme properties, typography settings, and animation utilities for the Servexa design system.",
  "project_state.json": "Project metadata tracking Servexa's features, known issues (admin route not loading in Chrome), and architectural notes about the booking system and admin dashboard."
}