{
  "backend/main.mo": "Motoko actor implementing a booking management system with CRUD operations for service bookings, including submission, retrieval, status updates, and toggle functionality using a Map-based storage.",
  "feature_evidence.json": "Feature evidence report documenting five implemented authentication and authorization features including protected admin routes, public booking form, Internet Identity login/logout, and access control.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of 20 frontend component files covering routing, booking forms, admin dashboard, authentication, UI components, and styling configuration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for backgrounds, borders, and UI components.",
  "frontend/index.html": "HTML entry point for the Servexa Pvt Ltd website with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application using TanStack Router to define routes for home page, login page, and protected admin dashboard with shared root layout including Header component.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component displaying booking data in a table with status management dropdown, refresh functionality, logout button, and error/loading states using shadcn/ui components.",
  "frontend/src/components/BeforeAfterGallery.tsx": "Gallery component displaying before/after images of completed service work in a responsive grid with glassmorphism styling and hover effects.",
  "frontend/src/components/BookingForm.tsx": "A form component for customers to book home services, collecting name, phone, service category, and address. Displays a success message after submission and handles form validation and error states.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information including three phone numbers, a physical address in Kolkata, WhatsApp integration, and Instagram social link. Uses a two-column grid layout with glass-card styling.",
  "frontend/src/components/FAQSection.tsx": "Renders an accordion-style FAQ section with six common questions about service areas, pricing, technician certification, warranties, and brand coverage. Uses shadcn/ui Accordion component.",
  "frontend/src/components/FloatingWhatsApp.tsx": "A fixed floating button in the bottom-right corner that opens WhatsApp chat with a pre-filled message. Features pulse animation and hover effects.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright information for Servexa Pvt Ltd and a \"Built with caffeine.ai\" attribution link with heart icon.",
  "frontend/src/components/Header.tsx": "Fixed header with Servexa logo, company name, and action buttons for login/logout and calling. Integrates Internet Identity authentication and responsive design.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with background image, headline emphasizing fast/reliable/affordable services, CTA buttons for calling and WhatsApp, and trust badges showcasing verified technicians and guarantees.",
  "frontend/src/components/LoginPage.tsx": "Admin login page using Internet Identity authentication with loading states, error handling, and automatic redirect to admin dashboard upon successful authentication.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that checks Internet Identity authentication status, displays loading states during initialization, and redirects unauthenticated users to the login page.",
  "frontend/src/components/ServiceAreas.tsx": "Displays a section showing the two service areas (Kolkata and Howrah) with map pin icons in a responsive grid layout.",
  "frontend/src/components/ServicesSection.tsx": "Renders a three-column grid showcasing service categories (Home Appliance Repair, Plumbing, Electrical) with icons and itemized service lists.",
  "frontend/src/components/StickyCallBar.tsx": "A fixed bottom bar for mobile devices that displays a prominent call-to-action button with the business phone number.",
  "frontend/src/components/TestimonialSlider.tsx": "An auto-rotating carousel component displaying customer testimonials with star ratings, navigation buttons, and dot indicators.",
  "frontend/src/components/WhyChooseUs.tsx": "Displays a grid of five benefit cards highlighting company advantages like skilled technicians, fast service, affordable pricing, brand coverage, and same-day availability.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks, managing AuthClient creation, login/logout flows, identity persistence, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for booking operations: submitting new bookings, fetching all bookings, and updating booking status with automatic cache invalidation.",
  "frontend/src/index.css": "Global stylesheet defining CSS custom properties for the design system (navy/gold color scheme), Tailwind configuration, and utility classes for glass morphism effects and gold shadows.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient and InternetIdentityProvider wrappers for state management and authentication.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (navy, gold, oklch-based theme variables), typography, container queries, animations, and extended design tokens for the UI.",
  "project_state.json": "Project metadata tracking Internet Identity authentication implementation progress, with features for protecting admin routes while keeping public booking form accessible."
}