{
  "backend/main.mo": "Main actor defining booking management system with functions to submit, retrieve, and update booking status, storing bookings in a Map with auto-incrementing IDs.",
  "backend/migration.mo": "Migration module that transforms old booking records without status field to new booking records with a default 'pending' status.",
  "feature_evidence.json": "Feature evidence report documenting four implemented admin dashboard features with high confidence, including table display, status tracking, routing, and React Query integration.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend component files describing their purpose, functionality, and styling approach.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with navy and gold color scheme.",
  "frontend/index.html": "HTML entry point for the Servexa website with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Application root using TanStack Router to define routes for home page and admin dashboard with shared layout containing header and navy gradient background.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component displaying all bookings in a responsive table with status badges, dropdown menus for status updates, loading/error states, and glassmorphism styling.",
  "frontend/src/components/BeforeAfterGallery.tsx": "Gallery component displaying before/after service images in a grid layout with glassmorphism cards and hover effects.",
  "frontend/src/components/BookingForm.tsx": "A React form component for booking home services that collects customer name, phone, service category, and address, then submits via a mutation hook and displays a success message.",
  "frontend/src/components/ContactSection.tsx": "Displays contact information including three phone numbers, a WhatsApp button, physical address in Kolkata, and Instagram social link in a two-column grid layout.",
  "frontend/src/components/FAQSection.tsx": "Renders an accordion-style FAQ section with six common questions about service areas, pricing, warranties, and technician certifications.",
  "frontend/src/components/FloatingWhatsApp.tsx": "A fixed-position floating button in the bottom-right corner that opens WhatsApp chat with a pre-filled message when clicked.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright information and a 'Built with caffeine.ai' attribution link.",
  "frontend/src/components/Header.tsx": "Fixed header with Servexa logo and a 'Call Now' button that initiates a phone call when clicked.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with background image, headline text, CTA buttons for calling/WhatsApp, and three trust badge cards highlighting service features.",
  "frontend/src/components/ServiceAreas.tsx": "Displays the two service areas (Kolkata and Howrah) in a simple two-column grid with map pin icons.",
  "frontend/src/components/ServicesSection.tsx": "Three-column grid showcasing service categories (Home Appliance Repair, Plumbing, Electrical) with icons and bulleted lists of specific services offered.",
  "frontend/src/components/StickyCallBar.tsx": "Mobile-only sticky bottom bar with a prominent call button displaying the primary phone number, visible only on small screens.",
  "frontend/src/components/TestimonialSlider.tsx": "A React component that displays customer testimonials in an auto-rotating carousel with manual navigation controls, showing ratings, names, services, and feedback text.",
  "frontend/src/components/WhyChooseUs.tsx": "A React component that displays a grid of five key benefits/features of the Servexa service, each with an icon, title, and description.",
  "frontend/src/hooks/useActor.ts": "A custom React hook that manages the ICP backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "A custom React hook and context provider for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Custom React Query hooks for booking operations including submitting bookings, fetching all bookings, and updating booking status via the ICP backend actor.",
  "frontend/src/index.css": "Global CSS file defining Tailwind configuration, custom CSS variables for navy/gold color scheme, glass morphism effects, and shadow utilities for the Servexa brand.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom navy/gold colors using OKLCH color space, Poppins font family, custom border radii, and shadow utilities.",
  "project_state.json": "Project state file tracking a modern home services website for Servexa Pvt Ltd with urban luxury design, mobile-first responsive layout, and SEO optimization. Contains 10 implemented features including hero section, services cards, contact section, floating CTAs, footer, and performance optimizations."
}